InformationRegisters/КР_РеестрДокументовКОтражениюПродажИнтернетМагазина.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_РеестрДокументовКОтражениюПродажИнтернетМагазина</Name>
			<Comment>JIRA№ A2105505-725</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КР_СостоянияОтраженияПродажИнтернетМагазина</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СозданныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщенияПользователю</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаказаИнтернетМагазина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КР_ВидыОперацийПоОтражениюПродажИнтернетМагазина</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КР_РеестрДокументовКОтражениюПродажИнтернетМагазина/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////
//// Модуль набора записей регистра сведений "КР_РеестрДокументовКОтражениюПродажИнтернетМагазина"
//// Создан: 25.10.2022 Марченко С.Н., КРОК, JIRA№A2105505-725   
//// Разработка по ФДР С71.003 Интеграция УТ10 Торговля - УТ11. Цены и ОРП


#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьСостояние(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьСостояниеЗавершение", ЭтотОбъект); 
	ПоказатьВводЗначения(ОписаниеОповещения, , 
		НСтр("ru = 'Выберите новое состояние'"), Тип("ПеречислениеСсылка.КР_СостоянияОтраженияПродажИнтернетМагазина"));
	
КонецПроцедуры  

&НаКлиенте
Процедура ИзменитьСостояниеЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Результат) Тогда 
		Возврат;
	КонецЕсли;
	
	ИзменитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, Результат);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ИзменитьСостояниеНаСервере(Знач ВыделенныеСтроки, Состояние)
	
	Менеджер = РегистрыСведений.КР_РеестрДокументовКОтражениюПродажИнтернетМагазина;
	Для Каждого СтрокаЗаписи Из ВыделенныеСтроки Цикл 
		
		Запись = Менеджер.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаЗаписи, "Объект,НомерЗаказаИнтернетМагазина,ВидОперации"); 
    	Запись.Прочитать();
		Если Не Запись.Выбран() Тогда   
			Возврат;
		КонецЕсли;	
		Запись.Состояние = Состояние;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
